Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: རབ་འབྱོར་དཀར་པོ་རྣམ་པར་མཐོང་བའི་ས་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །རིགས་ཀྱིས་དང་།
en: Subhūti,” replied the Blessed One, “after perfecting (1) the level of bright insight, bodhisattva great beings will attain consummate buddhahood in unsurpassed, complete enlightenment.

source: བརྒྱད་པའི་ས་དང་།
en: After perfecting (2) the level of the spiritual family, (3) the eighth-lowest level, (4) the level of insight, (5) the level of attenuated refinement, (6) the level of no attachment, and (7) the level of [an arhat’s] spiritual achievement, bodhisattva great beings will attain consummate buddhahood in unsurpassed, complete enlightenment. {

source: མཐོང་བའི་ས་དང་།
en: Ki.

source: སྲབས་པའི་ས་དང་། འདོད་ཆགས་དང་བྲལ་བའི་ས་དང་། བྱས་པ་རྟོགས་པའི་ས་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: IV: 176} After perfecting (8) the level of the pratyekabuddhas, bodhisattva great beings will attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །རང་སངས་རྒྱས་ཀྱིས་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: After perfecting (9) the level of the bodhisattvas, bodhisattva great beings will attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །སངས་རྒྱས་ཀྱིས་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: After perfecting (10) the level of the buddhas, bodhisattva great beings will attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བཅུ་ལ་སློབ་པ་ནི་སེམས་དང་པོ་བསྐྱེད་པས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མ་ཡིན། སེམས་དང་པོ་བསྐྱེད་པ་ལ་མ་བརྟེན་པར་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མ་ཡིན་སེམས་ཕྱི་མ་བསྐྱེད་པས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མ་ཡིན།
en: Bodhisattva great beings who train in those ten levels will not attain consummate buddhahood in unsurpassed, complete enlightenment through their initial setting of the mind on enlightenment, nor will they attain consummate buddhahood in unsurpassed, complete enlightenment independent of their initial setting of the mind on enlightenment.

source: སེམས་ཕྱི་མ་བསྐྱེད་པ་ལ་མ་བརྟེན་པར་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མ་ཡིན་མོད་ཀྱི།
en: They will not attain consummate buddhahood in unsurpassed, complete enlightenment through their final setting of the mind on enlightenment, nor will they attain consummate buddhahood in unsurpassed, complete enlightenment independent of their final setting of the mind on enlightenment.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་ཡང་རྒྱའོ། །གསོལ་པ།
en: And yet, they will indeed attain consummate buddhahood in unsurpassed, complete enlightenment.” “

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་སེམས་དང་པོ་བསྐྱེད་པས་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མ་ལགས་ལ། སེམས་དང་པོ་བསྐྱེད་པ་ལ་མ་བརྟེན་པར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མ་ལགས་པ་དང་། སེམས་སླད་མ་བསྐྱེད་པས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མ་ལགས་ལ། སེམས་སླད་མ་བསྐྱེད་པ་ལམ་བརྟེན་པར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མ་ལགས་ཤིང་།
en: Blessed Lord, in this way bodhisattva great beings will not attain consummate buddhahood in unsurpassed, complete enlightenment through their initial setting of the mind on enlightenment, nor will they attain consummate buddhahood in unsurpassed, complete enlightenment independent of their initial setting of the mind on enlightenment; and bodhisattva great beings will not attain consummate buddhahood in unsurpassed, complete enlightenment through their final setting of the mind on enlightenment, nor will they attain consummate buddhahood in unsurpassed, complete enlightenment independent of their final setting of the mind on enlightenment.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེ་ནི།
en: And yet, Blessed Lord, they will still attain consummate buddhahood in unsurpassed, complete enlightenment.

source: རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཟབ་བོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: That is profound dependent origination!” “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། སེམས་གང་འགགས་པ་དེ་ཕྱིར་སྐྱེ་བར་འགྱུར་རམ།
en: Subhūti, do you think that thoughts that have ceased will arise again?”

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས་སེམས་སྐྱེས་པ་དེ་འགག་པའི་ཆོས་ཅན་ཡིན་ནམ།
en: Subhūti, do you think that thoughts that have arisen have the characteristic of cessation?”

source: བཅོམ་ལྡན་འདས་དེ་ནི་འགག་པའི་ཆོས་ཅན་ཡིན་ནོ།
en: Blessed Lord, they do have the characteristic of cessation.

source: །བདེ་བར་གཤེགས་པ་དེ་ནི་འགག་པའི་ཆོས་ཅན་ཡིན་ནོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Sugata, they do have the characteristic of cessation!” “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། གང་འགག་པའི་ཆོས་ཅན་དེ་འགག་པར་འགྱུར་རམ།
en: Subhūti, do you think that that which has the characteristic of cessation will cease to be so?”

source: དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་དེ་བཞིན་དུ་གནས་པར་འགྱུར་རམ།
en: Will it dwell definitively, just like the real nature?”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་དེ་བཞིན་དུ་གནས་པར་འགྱུར་རོ།
en: Blessed Lord, it will dwell definitively, just like the real nature.” {Ki.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གལ་ཏེ་དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་དེ་བཞིན་དུ་གནས་པར་འགྱུར་ན་རྟག་པར་མི་འགྱུར་རམ་གསོལ་པ།
en: IV: 177} The Blessed One then asked, “Subhūti, if it dwells definitively, just like the real nature, will it not become a permanent state?” “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། །དེ་བཞིན་ཉིད་ཟབ་བམ།
en: Subhūti, do you think that the real nature is profound?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཟབ་བོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: asked the Blessed One. “Blessed Lord, it is profound.” “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། སེམས་དེ་ཡང་དེ་བཞིན་ཉིད་དམ།
en: Subhūti, do you think that the mind is also the real nature?”

source: དེ་བཞིན་ཉིད་ལས་སེམས་དེ་གུད་ན་ཡོད་དམ།
en: Subhūti, do you think that the mind is other than the real nature?”

source: སེམས་ལ་དེ་བཞིན་ཉིད་ཡོད་དམ།
en: Is the real nature present in the mind?”

source: དེ་བཞིན་ཉིད་ལ་སེམས་ཡོད་དམ།
en: Is the mind present in the real nature?”

source: དེ་བཞིན་ཉིད་ཀྱིས་དེ་བཞིན་ཉིད་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངམ།
en: Does the real nature observe the real nature?”

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། གང་དེ་ལྟར་སྤྱོད་པ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡིན་ན།
en: Subhūti, do you think that those who practice in that manner are practicing the perfection of wisdom?”

source: བཅོམ་ལྡན་འདས་གང་དེ་ལྟར་སྤྱོད་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, those who practice in that manner do practice the perfection of wisdom.” “

source: རབ་འབྱོར་ཇི་སྙམ་དུ་སེམས་གང་དེ་ལྟར་སྤྱོད་པ་དེ་གང་ལ་སྤྱོད་པ་ཡིན།
en: Subhūti, what do you think it is that those who practice in that manner are practicing?”

source: བཅོམ་ལྡན་འདས་གང་དེ་ལྟར་སྤྱོད་པ་དེ་ནི་ཅི་ལ་ཡང་མི་སྤྱོད་དོ།
en: Blessed Lord, those who practice in that manner do not practice anything at all.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་དེ་བཞིན་ཉིད་ལ་གནས་པ་ལ་ཡོངས་སུ་རྒྱུ་བ་དེ་དག་མི་འཇུག་མི་འབྱུང་ངོ་།
en: If you ask why, Blessed Lord, it is because bodhisattva great beings who practice the perfection of wisdom and dwell in the real nature do not indulge in habitual thoughts, and they do not experience them.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་ཉིད་ནི་གང་དུ་ཡང་ཡོངས་སུ་རྒྱུ་བ་མ་མཆིས་ཏེ། དེ་ཉིད་ལའང་གང་ཡང་རྒྱུ་བ་མ་མཆིས་སོ།
en: If one were to ask why, Blessed Lord, the real nature is not habituated to anything at all—it is not habituated at all, even to itself.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་གང་ལ་སྤྱོད་པ་ཡིན།
en: Subhūti, in what do bodhisattva great beings who practice the perfection of wisdom actually engage?”

source: དེ་ནི་གང་ལ་གཉིས་ཀྱི་ཡོངས་སུ་རྒྱུ་བ་མཆིས་པའི་དོན་དམ་པ་ལ་སྤྱོད་དོ།
en: They engage in ultimate reality where dualistic habitual thoughts are nonexistent.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། གང་དོན་དམ་པ་ལ་སྤྱོད་པ་དེ་ཡོངས་སུ་རྒྱུ་བ་ལ་སྤྱོད་པའམ། མཚན་མ་ལ་སྤྱོད་པ་ཡིན་ནམ།
en: Subhūti, do you think that those who engage in ultimate reality engage in habitual thoughts or do they engage in conceptual images?”

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། དེས་མཚན་མར་འདུ་ཤེས་པ་རྣམ་པར་བཤིག་པ་ཡིན་ནམ།
en: Subhūti, do you think that they have annihilated the perception of conceptual images?”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་མཚན་མའི་འདུ་ཤེས་རྣམ་པར་བཤིག་པ་ཡིན། གསོལ་པ།
en: The Blessed One then asked, “How then do bodhisattva great beings accordingly annihilate the perception of conceptual images?” “

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་ནི། འདི་ལྟར་མཚན་མ་རྣམ་པར་གཞིག་པར་བྱའོ་ཞེ་འམ། མཚན་མ་མེད་པ་རྣམ་པར་གཞིག་པར་བྱའོ་སྙམ་དུ་མི་སྦྱོར་རོ།
en: Blessed Lord, bodhisattva great beings who practice the perfection of wisdom do not apply themselves, wondering whether they should annihilate conceptual images, or whether they should annihilate nonconceptual images.

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་སྤྱོད་པ་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་མ་བགྱིས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་སྟེ།
en: Blessed Lord, bodhisattva great beings who practice the perfection of wisdom do not attain consummate buddhahood in unsurpassed, complete enlightenment without having perfected the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.

source: བཅོམ་ལྡན་འདས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐབས་མཁས་པ་སྟེ། ཐབས་མཁས་པ་དེས་ཆོས་གང་ཡང་དངོས་པོར་ཡང་མི་བགྱིད་དངོས་པོ་མ་མཆིས་པར་ཡང་མི་བགྱིད་དོ།
en: Blessed Lord, it is the skill in means of bodhisattva great beings through which they do not make anything at all into an entity, and through which they do not make anything at all into a nonentity.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་ཐམས་ཅད་ཀྱི་རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་དུ་རིག་པའི་སླད་དུ་སྟེ། རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་དེ་ལ་གནས་ནས།
en: If one were to ask why, Blessed Lord, it is because bodhisattva great beings, in order that the intrinsic defining characteristics of all phenomena might be known as emptiness, dwell in that emptiness of intrinsic defining characteristics.

source: སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་ཏིང་ངེ་འཛིན་གསུམ་ལ་སྙོམས་པར་འཇུག་སྟེ། ཏིང་ངེ་འཛིན་དེ་དག་གིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིས་ན། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་ཏིང་ངེ་འཛིན་གསུམ་ལ་སྙོམས་པར་འཇུག་ཅིང་། ཏིང་ངེ་འཛིན་དེ་དག་གིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: If they then become absorbed in the three meditative stabilities for the sake of beings, and bring beings to maturity through these meditative stabilities, how, Blessed Lord, do those bodhisattva great beings become absorbed in the three meditative stabilities and bring beings to maturity through those meditative stabilities?”

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་གསུམ་ལ་གནས་ཤིང་སེམས་ཅན་གང་རྣམ་པར་རྟོག་པའི་འདུ་ཤེས་ལ་སྤྱོད་པ་དེ་དག་ནི་སྟོང་པ་ཉིད་ལ་རབ་ཏུ་འགོད་དོ།
en: The Blessed One replied, “In this regard, Subhūti, bodhisattva great beings dwell in the three meditative stabilities and they establish in emptiness those beings who indulge in the perception of discriminating thoughts.

source: །སེམས་ཅན་གང་མཚན་མ་ལ་སྤྱོད་པ་དེ་དག་ནི་མཚན་མ་མེད་པ་ལ་རབ་ཏུ་འགོད་དོ།
en: They establish in signlessness those beings who indulge in conceptual images.

source: །སེམས་ཅན་གང་སྨོན་པ་ལ་སྤྱོད་པ་དེ་དག་ནི་སྨོན་པ་མེད་པ་ལ་སྦྱོར་རོ།
en: They unite in wishlessness those beings who indulge in aspirations.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཏིང་ངེ་འཛིན་གསུམ་ལ་གནས་ཏེ། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ།
en: So it is, Subhūti, that bodhisattva great beings practice the perfection of wisdom, dwell in the three meditative stabilities, and bring beings to maturity.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་བཞི་བཅུ་གཅིག་པའོ།། །།དེ་ནས་ཡང་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས།
en: This completes the forty-first chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ལ་ལ་རྨི་ལམ་དུ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་གསུམ་ལ་སྙོམས་པར་ཞུགས་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་རྣམ་པར་འཕེལ་ལམ།
en: Chapter 42 Then the venerable Śāradvatīputra asked the venerable Subhūti, “Venerable Subhūti, when certain bodhisattva great beings are absorbed in the three meditative stabilities of emptiness, signlessness, and wishlessness in their dreams, are they enhanced by the perfection of wisdom?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་ཉིན་པར་བསྒོམས་པས་རྣམ་པར་འཕེལ་ན། རྨི་ལམ་ན་བསྒོམས་པས་ཀྱང་རྣམ་པར་འཕེལ་ལོ།
en: Venerable Śāradvatīputra,” replied Subhūti, “if they are enhanced by cultivating it during the day, they would also be enhanced by cultivating it in their dreams.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྨི་ལམ་དང་ཉིན་པར་ནི་རྣམ་པར་རྟོག་པ་མེད་དོ།
en: If you ask why, Venerable Śāradvatīputra, they are without discriminating thoughts concerning dreams and daytime experiences.

source: ཚེ་དང་ལྡན་པ་ཤ་དྭ་ཏིའི་བུ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉིན་པར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོད་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྨི་ལམ་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡང་ཡོད་པར་འགྱུར་རོ།
en: Venerable Śāradvatīputra, if {Ki.IV: 179} bodhisattva great beings who practice the perfection of wisdom during the day do cultivate the perfection of wisdom, then bodhisattva great beings will also cultivate the perfection of wisdom in their dreams.” “

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྨི་ལམ་དུ་ལས་ཤིག་བྱས་ན་ལས་དེ་ལ་སོགས་པའམ།
en: Venerable Subhūti, when bodhisattva great beings perform an action in their dreams, will that action accumulate or diminish?

source: འབྲི་བར་འགྱུར་བ་ཡོད་དམ་གལ་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུར་གསུངས་ན། དེ་ལ་སོགས་པའམ་འབྲི་བར་འགྱུར་བ་མེད་དོ།
en: If, as the Blessed One has said, all phenomena are like dreams, then there would be no accumulation or diminution.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རྨི་ལམ་གྱི་ཆོས་གང་ཡང་སོགས་པའམ། འབྲི་བ་མི་དམིགས་ཏེ།
en: If you ask why, there is no accumulation or diminution of anything at all that is apprehended in dreams.

source: གལ་ཏེ་སད་ནས་རྣམ་པར་རྟོག་ན་ནི། དེ་ལ་སོགས་པ་འམ་འབྲི་བར་ཡང་འགྱུར་རོ།
en: But if, on waking up, one ponders it, then there will indeed be an accumulation or diminution of that [action].”

source: །རབ་འབྱོར་གྱིས་སྨྲས་པ། ཉིན་པར་སྲོག་བཅད་པ་དང་། རྨི་ལམ་ན་སྲོག་བཅད་པ་དེ་ལ་འདི་སྙམ་དུ་དེ་བདག་གིས་བསད་དོ།
en: Subhūti replied, “If one who has committed an act of killing by day and one who has committed an act of killing in a dream were to think, ‘I have killed.

source: །དེ་བདག་གིས་བསད་པ་ལེགས་སོ་ཞེས་སད་དེ་རྣམ་པར་རྟོག་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལས་དེ་ལ་ཁྱོད་ཅི་ཟེར།
en: It is right that I have killed,’ in that case, Venerable Śāradvatīputra, what would you say about that action?” “

source: སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དམིགས་པ་མེད་པར་ལས་མི་སྐྱེའོ།
en: Venerable Subhūti, no action will occur without an objective support.

source: །དམིགས་པ་མེད་པར་སེམས་པ་མི་འབྱུང་ངོ་།
en: No volition will occur without an objective support.” “

source: །རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ཏེ།
en: Venerable Śāradvatīputra, it is so!” replied Subhūti. “

source: དམིགས་པ་མེད་པར་ལས་མི་སྐྱེའོ།
en: No action will occur without an objective support.

source: །དམིགས་པ་དང་བཅས་པར་ལས་སྐྱེ་སྟེ། དམིགས་པ་མེད་པར་མ་ཡིན་ནོ།
en: Actions will occur with an objective support, but not without an objective support.

source: །དམིགས་པ་དང་བཅས་པར་སེམས་པ་འབྱུང་སྟེ། དམིགས་པ་མེད་པར་མ་ཡིན་ནོ།
en: Volition will occur with an objective support, but not without an objective support.

source: །མཐོང་བ་དང་ཐོས་པ་དང་། བསམས་པ་དང་། རྣམ་པར་རིག་པའི་ཆོས་རྣམས་ལ་བློ་འཇུག་སྟེ།
en: The mind engages with phenomena that are seen, heard, thought of, and appraised.

source: མ་མཐོང་མ་ཐོས་མ་བསམས་རྣམ་པར་མ་རིག་པའི་ཆོས་ལ་ནི་བློ་མི་འཇུག་གོ།
en: The mind does not engage with phenomena that are unseen, unheard, not thought of, and not appraised.

source: །དེ་ལ་བློ་ལ་ལ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་ཡོངས་སུ་འཛིན་ཏོ། །བློ་ལ་ལ་ནི་རྣམ་པར་བྱང་བ་ཡོངས་སུ་འཛིན་ཏོ།
en: On that basis some minds grasp afflicted mental states, and some minds grasp purified mental states.

source: །དེ་བས་ན་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དམིགས་པ་དང་བཅས་པར་ལས་སྐྱེ་སྟེ། དམིགས་པ་མེད་པར་མ་ཡིན་ནོ།
en: Therefore, Venerable Śāradvatīputra, actions occur with an objective support, but not without an objective support.

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལས་ཐམས་ཅད་དང་། སེམས་པ་ཐམས་ཅད་དབེན་པའོ་ཞེས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་ན། དེ་ཇི་ལྟར་དམིགས་པ་དང་བཅས་པར་ལས་སྐྱེ་སྟེ། དམིགས་པ་མེད་པར་མ་ཡིན།
en: Venerable Subhūti, if, as the Blessed One has said, all actions and all volitions are void, how then do actions occur with an objective support, but not without an objective support?

source: དམིགས་པ་དང་བཅས་པར་སེམས་པ་འབྱུང་སྟེ། དམིགས་པ་མེད་པར་མ་ཡིན།
en: How do volitions occur with an objective support, but not without an objective support?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་མཚན་མར་བྱས་ནས་དམིགས་པ་དང་བཅས་པར་ལས་སྐྱེ་སྟེ། དམིགས་པ་མེད་པར་མ་ཡིན་ནོ།
en: Venerable Śāradvatīputra,” replied Subhūti, “following the creation of a conceptual image, actions occur with an objective support, but do not without an objective support.

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྨི་ལམ་དུ་སྦྱིན་པ་བྱིན། ཚུལ་ཁྲིམས་བསྲུངས། བཟོད་པ་བསྒྲུབས། བརྩོན་འགྲུས་བརྩམས། བསམ་གཏན་ལ་མཉམ་པར་བཞག །
en: Venerable Subhūti, if bodhisattva great beings in their dreams have dispensed generosity, maintained ethical discipline, practiced tolerance, undertaken perseverance, become absorbed in meditative concentration, {Ki.

source: ཤེས་རབ་བསྒོམས་ཏེ། དགེ་བའི་རྩ་བ་དེ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ན། དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པར་འགྱུར་རམ།
en: IV: 180} and cultivated wisdom, and then they dedicate those roots of virtuous action to unsurpassed, complete enlightenment, would they actually dedicate them to unsurpassed, complete enlightenment?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ། བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱིར་མི་ལྡོག་པར་ལུང་བསྟན་པ་འདི་མངོན་དུ་གྱུར་ན། འདི་ལ་དྲིས་ཤིག་དང་འདི་ལན་ལྡོན་པར་འགྱུར་རོ།
en: Venerable Śāradvatīputra,” replied Subhūti, “since the bodhisattva great being Maitreya is destined for only one more rebirth and has been manifestly prophesied by the Blessed One as irreversible, you should ask him, and he will answer this point.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་གནས་བརྟན་རབ་འབྱོར་འདི་ནི་འདི་སྐད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་འདི་མངོན་དུ་གྱུར་པ་ནི་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་ཕྱིར་མི་ལྡོག་པར་བཅོམ་ལྡན་འདས་ཀྱིས་ལུང་བསྟན་པ་སྟེ།
en: Thereupon the venerable Śāradvatīputra asked the bodhisattva great being Maitreya, “Noble son, this elder Subhūti has said, ‘The bodhisattva great being Maitreya has been manifestly prophesied by the Blessed One as irreversible because he is destined for only one more rebirth.

source: འདི་ལ་དྲིས་ཤིག་དང་འདི་ལན་ལྡོན་པར་འགྱུར་རོ་ཞེས་ཟེར་རོ། །དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: You should ask him, and he will answer this point!’ ”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཅི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ཞེས་བྱ་བའི་མིང་འདི་ལན་ལྡོན་ནམ།
en: The bodhisattva great being Maitreya then said to the venerable Śāradvatīputra, “Will this one named the bodhisattva great being Maitreya answer?

source: འོན་ཏེ་གཟུགས་ལན་གློན་ནམ།
en: Or will physical forms answer?

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལན་གློན་པར་འགྱུར།
en: Or will feelings, perceptions, formative predispositions, and consciousness answer?

source: འོན་ཏེ་གཟུགས་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ལན་གློན་པར་འགྱུར་རམ།
en: Or else will the emptiness of physical forms answer?

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ལན་གློན་པར་འགྱུར།
en: Will the emptiness of feelings, perceptions, formative predispositions, and consciousness answer?

source: འོན་ཏེ་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ལན་གློན་པར་འགྱུར་རམ།
en: Or else will the real nature of physical forms answer?

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ལན་གློན་པར་འགྱུར།
en: Will the real nature of feelings, perceptions, formative predispositions, and consciousness answer?

source: གཟུགས་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ལ་ནི་ལན་གློན་པའི་མཐུ་མེད་དོ།
en: The emptiness of physical forms and the emptiness of feelings, perceptions, formative predispositions, and consciousness has no ability to answer.

source: །གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ལ་ནི་ལན་གློན་པའི་མཐུ་མེད་དོ།
en: The real nature of physical forms and the real nature of feelings, perceptions, formative predispositions, and consciousness has no ability to answer.

source: །བདག་གིས་ནི་གང་ལན་གློན་པ་དང་། གང་གིས་ལན་གློན་པ་དང་། གང་གིས་ལན་གླན་པ་དང་། གང་ལ་ལན་གླན་པའི་ཆོས་དེ་ལྟ་བུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ངོ་།
en: I do not observe anything that would answer, by which an answer is given, or with respect to which an answer is given.

source: །གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་དང་། གང་གིས་ལུང་བསྟན་པ་དང་། གང་ལ་ལུང་བསྟན་པའི་ཆོས་དེ་ཡང་བདག་གིས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་པ་སྟེ།
en: I do not observe anything that is prophesied to attain unsurpassed, complete enlightenment, anything by which that is prophesied, or anything with respect to which that is prophesied.

source: ཆོས་དེ་དག་ཐམས་ཅད་ནི་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་པའོ།
en: All these phenomena are not two things and are not to be divided into two.”

source: །ཤ་ར་དྭ་ཏིའི་བུས་སྨྲས་པ། ཆོས་དེ་དག་ཇི་སྐད་དུ་བཤད་པ་དེ་བཞིན་དུ་ཆོས་དེ་དག་ཁྱོད་ཀྱིས་མངོན་དུ་བྱས་སམ།
en: Śāradvatīputra then asked, “Have you realized those phenomena, just as you have explained them?” “

source: བྱམས་པས་སྨྲས་པ། ཆོས་དེ་དག་ཇི་སྐད་བཤད་པ་དེ་ལྟར་ཆོས་དེ་དག་བདག་གིས་མངོན་དུ་བྱས་པ་མེད་དོ།
en: I have not realized those phenomena, just as I have explained them,” replied Maitreya.
